#ifndef __USART_H__
#define __USART_H__
#include "stm32f10x.h"

struct a1  //标志位
{
	u8 USART1_i;    //串口1接收数据
	u8 USART1_New;  //串口1有新的接收数据
	u8 Handle;      //数据处理
};  
extern struct a1 UsartBit;


/*******申明串口数据包******/
extern u8 USART1_Data[13];	//串口1的接收数据包

//*********************************************************函数或者变量声明
/*************************************************
函数: Usart_Init(void)
功能: 串口初始化
参数: 无
返回: 无
**************************************************/
extern void Usart_Init(void);
/*************************************************
函数: Usart1_PutChar(u8 ch)
功能: 串口1发送1字节
参数: 无
返回: 无
**************************************************/
extern void Usart1_PutChar(u8 ch);

#endif
